CSI API ETABS v1
cFrameObj.GetElm Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetElm(
	string Name,
	ref int NElm,
	ref string[] Elm,
	ref double[] RDI,
	ref double[] RDJ
)
Function GetElm (
	Name As String,
	ByRef NElm As Integer,
	ByRef Elm As String(),
	ByRef RDI As Double(),
	ByRef RDJ As Double()
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim NElm As Integer
Dim Elm As String()
Dim RDI As Double()
Dim RDJ As Double()
Dim returnValue As Integer
returnValue = instance.GetElm(Name, NElm,
	Elm, RDI, RDJ)
int GetElm(
	String^ Name,
	int% NElm,
	array<String^>^% Elm,
	array<double>^% RDI,
	array<double>^% RDJ
)
abstract GetElm :
        Name : string *
        NElm : int byref *
        Elm : string[] byref *
        RDI : float[] byref *
        RDJ : float[] byref -> int
Parameters
Name
Type: System.String
NElm
Type: System.Int32
Elm
Type: System.String[]
RDI
Type: System.Double[]
RDJ
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace